 
                                  3/14 Pune tabl.
apasă Start=10      §1/14 diz.tab.§2
aștept min §3:§4   Pune tabletă și
apasă P10=START     dizolv. Tabletă
min §1:§2           Spalare
6 X       §1                te rog așteaptă
                     
                                  2/14 Spălare
Activă                 Spălare
Activă                       
                                  11/14Sari ultima
cafea DA=1         §1/14 Rep.spăl.
§2/2 DA=10 NU=ot    1/14 Perie man.
și apasă 10         4/14 Grupul se
închide              5/14 2lea ciclu
diz. va începe      §1/14 §2 Spăl
activă §3             Grup în
poz. deschisă               14/14 Spăl. Grup
Finaliz. 10=Ieși   Clătire
§1 Mixer §2                 Clătire
§1 Grup                     Start procedură?
DA=10 NU=8         §1/14 §2 Spăl.
te rog așteaptă      12/14 Furnizare
cafea               §1/§2 golire
în curs                §1/§2 con. sol.
detartare OK=10     §1/§2 umpl.sol.
detar. în curs      §1/§2 apa
curge?   DA=10            §1/§2  umpl.
sol. detar.            §1/§2  acțion.
sol.=>min §3:§4      §1/§2sol.detar.
scurgere §3/§4      §1/§2 rezultat?
OK=10 NU=ALTELE     §1/§2conectare
apă    OK=10         §1/§2 umplere
apă în curs           §1/§2 clătire
cu apă                §1/§2 furn. și
test. apă Y=10       §1/§2 prelev.
apă pentru test       §1/§2 detar.
finaliz. IEȘI=10       §1/§2 deschide
rob. boiler Y=10     §1/§2 închide
rob. boiler Y=10      autoclătire
în curs                 Clăt. periodică
în §1 secunde       procedură: MAN=8
9=A.Skip AUTO=10    
                                  